nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/eth/processor/eth_p32mz2025daa288.h
PLIB_INLINE_API bool PLIB_ETH_MIIMScanModeIsEnabled(ETH_MODULE_ID index)
{
     return ETH_MIIMScanModeIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsMIIMScanMode(ETH_MODULE_ID index)
{
     return ETH_ExistsMIIMScanMode_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MIIMReadStart(ETH_MODULE_ID index)
{
     ETH_MIIMReadStart_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MIIMWriteStart(ETH_MODULE_ID index)
{
     ETH_MIIMWriteStart_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsMIIMReadWrite(ETH_MODULE_ID index)
{
     return ETH_ExistsMIIMReadWrite_Default(index);
}

PLIB_INLINE_API uint8_t PLIB_ETH_PHYAddressGet(ETH_MODULE_ID index)
{
     return ETH_PHYAddressGet_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_PHYAddressSet(ETH_MODULE_ID index, uint8_t phyAddr)
{
     ETH_PHYAddressSet_Default(index, phyAddr);
}

PLIB_INLINE_API uint8_t PLIB_ETH_RegisterAddressGet(ETH_MODULE_ID index)
{
     return ETH_RegisterAddressGet_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_RegisterAddressSet(ETH_MODULE_ID index, uint8_t regAddr)
{
     ETH_RegisterAddressSet_Default(index, regAddr);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsMIIMAddresses(ETH_MODULE_ID index)
{
     return ETH_ExistsMIIMAddresses_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MIIMWriteDataSet(ETH_MODULE_ID index, uint16_t writeData)
{
     ETH_MIIMWriteDataSet_Default(index, writeData);
}

PLIB_INLINE_API uint16_t PLIB_ETH_MIIMReadDataGet(ETH_MODULE_ID index)
{
     return ETH_MIIMReadDataGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsMIIWriteReadData(ETH_MODULE_ID index)
{
     return ETH_ExistsMIIWriteReadData_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_LinkHasFailed(ETH_MODULE_ID index)
{
     return ETH_LinkHasFailed_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_DataNotValid(ETH_MODULE_ID index)
{
     return ETH_DataNotValid_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_ClearDataNotValid(ETH_MODULE_ID index)
{
     ETH_ClearDataNotValid_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_MIIMIsScanning(ETH_MODULE_ID index)
{
     return ETH_MIIMIsScanning_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_MIIMIsBusy(ETH_MODULE_ID index)
{
     return ETH_MIIMIsBusy_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsMIIM_Indicators(ETH_MODULE_ID index)
{
     return ETH_ExistsMIIM_Indicators_Default(index);
}

PLIB_INLINE_API uint8_t PLIB_ETH_StationAddressGet(ETH_MODULE_ID index, uint8_t which)
{
     return ETH_StationAddressGet_Default(index, which);
}

PLIB_INLINE_API void PLIB_ETH_StationAddressSet(ETH_MODULE_ID index, uint8_t which, uint8_t stationAddress)
{
     ETH_StationAddressSet_Default(index, which, stationAddress);
}

PLIB_INLINE_API void PLIB_ETH_MACSetAddress(ETH_MODULE_ID index, uint8_t* bAddress)
{
     ETH_MACSetAddress_Default(index, bAddress);
}

PLIB_INLINE_API void PLIB_ETH_MACGetAddress(ETH_MODULE_ID index, uint8_t* bAddress)
{
     ETH_MACGetAddress_Default(index, bAddress);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsStationAddress(ETH_MODULE_ID index)
{
     return ETH_ExistsStationAddress_Default(index);
}

#endif
